Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་འབྱུང་བ་ནི་ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱི་རྒྱན་ལགས་སོ། །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་སངས་རྒྱས་བྱུང་བར་གྱུར་ན་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་འདི་ལྟ་བུ་འདི་དག་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །
en: “The appearance of a buddha is an ornament of the world of gods, humans, and asuras, because when a buddha emerges, wonderful and marvelous Dharma teachings such as this will emerge in the world!

source: བཅོམ་ལྡན་འདས་སྐྱེས་བུ་དམ་པ་འདི་དག་གིས་འཁོར་གྱི་ཁྱམས་འདིར་སེམས་བསྐྱེད་པ་གཅིག་གིས་བཀོད་པ་གང་བྱིན་གྱིས་བརླབས་པ་འདི་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བསྐལ་པ་བརྒྱ་ཕྲག་སྟོང་དུ་ཡང་སྟོན་པའི་རྔོ་མི་ཐོགས་སོ། །
en: “Blessed One, such a display of blessings through a single instance of generating the thought of awakening, in this pavilion by these noble beings, is beyond the capacity of śrāvakas and pratyekabuddhas to teach, even for a hundred thousand eons.

source: བཅོམ་ལྡན་འདས་དེ་ལ་བདག་འདི་སྙམ་བགྱིད་དེ། ཨེ་མ་ཇི་ཙམ་དུ་གང་རྫུ་འཕྲུལ་གྱིས་རྣམ་པར་སྤྲུལ་པའི་ཆོ་འཕྲུལ་འདི་ལྟ་བུ་འདི་མཐོང་ཡང་ཉན་ཐོས་ཀྱི་ཐེག་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་རེ་བ་སྐྱེད་པའི་སེམས་ཅན་ཤེས་རབ་འཆལ་པ་ཅན་དེ་དག་ནི་ངོ་མཚར་ཆེ་བ་སྙམ་བགྱིད་དོ། །
en: “This being so, I had the thought that it would be utterly astonishing were any beings, even after witnessing an amazing, miraculous, magical display such as this, to aspire for the vehicle of śrāvakas or vehicle of pratyekabuddhas with misguided understanding.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དང་པོ་བསྐྱེད་པ་ཉིད་ཀྱིས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཟིལ་གྱིས་ནོན་པའི་སླད་དུའོ། །
en: Blessed One, the very first generation of the thought of awakening of a bodhisattva overpowers all śrāvakas and pratyekabuddhas.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་ན་ཤེས་རབ་འཆལ་པའི་རང་བཞིན་ཅན་གྱི་མི་ལ་ལ་ཞིག་ནོར་བུ་རིན་པོ་ཆེ་བཻ་དཱུརྱ་བོར་ནས་ནོར་བུ་མཆིང་བུ་ལ་དམིགས་པ་སྙམ་དུ་སེམས་པ་དང་། བཅོམ་ལྡན་འདས་གང་དག་ཐེག་པ་ཆེན་པོ་བོར་ནས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་དམིགས་པར་བགྱི་བ་སྙམ་དུ་སེམས་པའི་སེམས་ཅན་དག་ནི་འདྲ་བ་ཉིད་དུ་བདག་ལ་གདའོ། །
en: When someone discards the Great Vehicle and thinks, ‘I will follow the vehicle of the śrāvakas or pratyekabuddhas,’ it is for me comparable to a person with misguided insight who discards a precious gem of beryl and thinks, ‘I prefer a semiprecious stone.’

source: བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དག་ལྷག་པའི་བསམ་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དང་། སྐྱེད་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ནི་རིང་པོར་མི་ཐོགས་པར་ཆོས་འདི་ལྟ་བུ་དང་ལྡན་པར་འགྱུར་རོ། །
en: Blessed One, those sons or daughters of noble family who have generated the thought of supreme perfect awakening with determination and all others who do so will, within a short while, attain such a teaching.”

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོས་བསྟན་པ་འདི་བཤད་པ་ན། ལྷ་དང་མིར་བཅས་པའི་སྐྱེ་དགུའི་འཁོར་དེ་ལས་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་སུམ་ཅུས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: When the bodhisattva Dharmeśvara­rāja had given this account, an immensely vast number of creatures among the retinue of many different beings, including gods and humans, generated the thought of supreme perfect awakening.

source: རྒྱན་བཀོད་པ་ཞེས་བྱ་བ་འདུས་པའི་ལེའུའོ།། །།
en: This concludes the Assembly chapter “Array of Ornaments.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་འདུས་པ་ཆེན་པོ་དེ་གཟིགས་ནས། ཨེ་མ་བྱང་ཆུབ་སེམས་དཔའ་འདུས་པ་འདི་དག་ནི་ཆོས་དོན་དུ་གཉེར་བ་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་མཛོད་འཛིན་པར་མཁྱེན་ནས་
en: After the Blessed One had surveyed the great assembly of bodhisattvas, he knew and rejoiced that the bodhisattvas who had assembled were holders of the treasure of the Tathāgata’s Dharma striving for righteousness.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པས་ངེས་པར་འབྱུང་བ། སྒྲིབ་པ་མེད་པའི་སྒོའི་ལེའུའི་ཆོས་ཀྱི་རྣམ་གྲངས་རབ་ཏུ་བཤད་པའི་ཕྱིར། མི་འཇིགས་པས་སྤོབས་པ་ཞེས་བྱ་བའི་འོད་ཟེར་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སྤྱི་གཙུག་ནས་བྱུང་ངོ་། །
en: In order for the Dharma discourse The Gateway to Unobstructed Deliverance through the Bodhisattva Way of Life to be explained, a light known as fearless eloquence, the mark of a great being, emerged from the crown of his head.

source: བཅོམ་ལྡན་འདས་ཀྱིས་འོད་ཟེར་དེ་ཕྱུང་མ་ཐག་ཏུ་དེ་ནས་ཐམས་ཅད་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ལ་ལན་བདུན་བསྐོར་བ་བྱས་ཏེ།
en: As soon as this light emerged, the Blessed One caused it to encircle the entire bodhisattva assembly seven times.

source: བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོའི་ལུས་ལ་ལན་བརྒྱར་བསྐོར་བ་བྱས་ནས། བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོའི་སྤྱི་གཙུག་ཏུ་མི་སྣང་བར་གྱུར་ཏོ། །
en: He then caused it to encircle the body of the bodhisattva Dhāraṇīśvara­rāja a hundred times, after which it disappeared into the crown of the head of the bodhisattva Dhāraṇīśvara­rāja.

source: འོད་དེས་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོ་ལ་རེག་མ་ཐག་ཏུ། དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོས་ཐམས་ཅད་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱི་འོད་དང་། སེང་གེའི་ཁྲི་དང་། ལུས་བརྒྱ་འགྱུར་དུ་ཟིལ་གྱིས་མནན་ནས་
en: The instant the light touched Dhāraṇīśvara­rāja, by the power of the Buddha the bodhisattva Dhāraṇīśvara­rāja eclipsed the radiance, lion thrones, and bodies of the entire bodhisattva assembly a hundred times.

source: ལམ་མེ། ལྷང་ངེ་། ལྷན་ནེའོ། །
en: He was brilliant, majestic, and resplendent.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོས་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་རིག་ནས་སྟན་ལས་ལངས་ཏེ།
en: At this point, the bodhisattva Dhāraṇīśvara­rāja became aware of the blessing of the Tathāgata and rose from his seat.

source: བླ་གོས་ཕྲག་པ་གཅིག་ལ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: He draped his upper garment over one shoulder and placed his right knee on the ground.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་གི་དྲང་ཐད་ཀྱི་སྟེང་གི་བར་སྣང་ལ་རིན་པོ་ཆེའི་གདུགས་དེ་བཞིན་གཤེགས་པའི་རྒྱན་ཅེས་བྱ་བ་
en: He proceeded to bow, with his palms joined, in the direction of the Blessed One and conjure up a precious parasol known as ornament of the Tathāgata in the space directly above the crown of the Blessed One’s head.

source: ཡུ་བ་ནི་བཻ་དཱུརྱ། གཡོགས་མ་ནི་གསེར། སྙིང་པོ་ནི་རིན་པོ་ཆེ་ནེ་ཚོ་འམ་ཅི། རྩིབས་ནི་ཨན་ད་རྙིལ་ལས་བྱས་པ། མུ་ཏིག་གི་དོ་ཤལ་རབ་ཏུ་སྤྱངས་པ། དར་གྱི་ལྡ་ལྡིས་མཛེས་པར་བྱས་པ།
en: With a handle of lapis, a cover of gold, a jeweled parrot at the center, and spokes of precious sapphire, it had garlands of pearls hanging down as pendants and was decorated with tassels of divine silk.

source: དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་འཁྲོལ་བ། བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱིས་བཟུང་བ། རྒྱར་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་ཚད་ཙམ་ཞིག་བྱིན་གྱིས་བརླབས་སོ། །
en: It resounded with filigrees of chimes, was upheld by the bodies of bodhisattvas, and was as vast as the trichiliocosm.

source: དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་རིན་པོ་ཆེའི་གདུགས་དེ་ལྟ་བུ་བྱིན་གྱིས་བརླབས་ནས་མེ་ཏོག་གི་ཆར་ཡང་ཕབ་སྟེ།
en: After he had conjured up such a precious parasol as an act of worshiping the Tathāgata, Dhāraṇīśvara­rāja brought down a rain of flowers.

source: སིལ་སྙན་དང་། སྒྲ་དབྱངས་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་སྒྲ་འབྱུང་བར་བྱིན་གྱིས་བརླབས་ནས། བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །
en: He intoned the sound of a constant uninterrupted melody accompanied by cymbals, and he praised the Blessed One with these words:

source: ཀུན་དུ་སྣང་བ་ཀུན་ནས་འོད་ཟེར་ཅན། །
en: “All-illuminating resplendent one!

source: དོན་རྣམས་མ་ལུས་སྟོན་པ་ཀུན་ནས་སྤྱན། །
en: Teacher of all and seer of all!

source: རང་བྱུང་ཆོས་ཀྱི་ངོ་བོ་ཉིད་ལ་མཁས། །
en: You who are skilled in the essence of spontaneously arisen Dharma

source: བསམ་གྱིས་མི་ཁྱབ་ཡོན་ཏན་ཀུན་དང་ལྡན། །
en: And endowed with all inconceivable good qualities,

source: སྐྱེས་བུ་ཁྱུ་མཆོག་གིས་ནི་འོད་ཟེར་ཕྱུང་། །
en: “You, leader of beings, emitted a light

source: ཞལ་ཡང་རྣམ་པར་སྦྱོང་ཞིང་འོད་མཛད་པ། །
en: And caused it to purify and illuminate my face.

source: འདྲེན་པ་དེ་ནི་བདག་གི་ལུས་ལ་ཡང་། །
en: O leader, you also caused the light

source: ལན་བརྒྱར་བསྐོར་བ་བགྱིས་ནས་སྤྱི་བོར་ཞི། །
en: To circle my body a hundred times and come at last to rest at my crown.

source: མི་ཡི་འདྲེན་པའི་འོད་ཀྱིས་རེག་པས་ན། །
en: “When the light of the leader of humans touched me,

source: གང་དག་བདག་གིས་སྔོན་ཐོབ་དྲན་པ་དང་། །
en: All that I had achieved before in terms of mindfulness,

source: བློ་གྲོས་སྤོབས་པ་སྣང་བ་དེ་བཞིན་གཟུངས། །
en: Intelligence, eloquence, illumination, and retention

source: རྣམ་པ་སྟོང་དུ་ཁྱད་པར་འཕགས་པར་གྱུར། །
en: Was augmented a thousand times.

source: བདག་ལུས་རབ་སིམ་སེམས་ནི་རྣམ་པར་དག །
en: “I became physically content, mentally clear,

source: བདག་གི་བློ་གྲོས་དགའ་མགུ་མཉམ་པར་གྱུར། །
en: Delightfully fulfilled, and serenely intelligent.

source: གཞན་ཡང་སངས་རྒྱས་མཁྱེན་པ་མཐའ་ཡས་དང་། །
en: Moreover, boundless buddha knowledge

source: སྤོབས་པ་བདག་གི་ལུས་ལ་རབ་ཏུ་ཞུགས། །
en: And eloquence possessed my body.

source: སངས་རྒྱས་མཐུ་ཆེན་བསྙེན་པར་དཀའ་བ་ལ། །
en: “The mighty Buddha is difficult to approach,

source: ཉམ་ཆུང་དག་གིས་མཉེས་པར་བགྱིད་མི་ནུས། །
en: And the meek are unable to please him.

source: སངས་རྒྱས་གནང་ནས་འགྲོ་ཀུན་ཕན་སླད་དུ། །
en: Having given this to the Buddha,

source: སངས་རྒྱས་ལ་ནི་ཞུ་བ་ཞུ་བར་འཚལ། །
en: I make this request for the benefit of all beings.

source: རྫོགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་འཇུག་དང་། །
en: “I request entry into perfect bodhisattva conduct

source: འཇིག་རྟེན་རྣམ་འདྲེན་དག་གི་འབྱུང་བ་དང་། །
en: And the emergence of spiritual leaders,

source: སྣང་དང་ངེས་འབྱུང་རྣམ་པར་སྤྲུལ་པ་དང་། །
en: The magical display of illumination and deliverance

source: དབང་བསྐུར་ཡེ་ཤེས་ཡོངས་སུ་ཞུ་བར་འཚལ། །
en: As well as consecration and wisdom.

source: ཐེག་མཆོག་དམ་པ་རྟོགས་པར་ཁོང་ཆུད་ཅིང་། །
en: “In order to benefit those who fully understand the excellent supreme vehicle,

source: མཐའ་ཡས་རྒྱ་ཆེ་བ་ཡི་འཁོར་ལྷགས་དང་། །
en: Who have joined the endless vast retinue,

source: གང་དག་རྒྱ་ཆེན་ཆོས་དོན་གཉེར་བ་དག །
en: And who endeavor for vast righteousness,

source: དེ་དག་ཕན་སླད་སངས་རྒྱས་ལ་ཡང་ཞུ། །
en: I make this request to the Buddha.

source: བདུད་ཀྱི་དཀྱིལ་འཁོར་ཤིན་ཏུ་ཚར་གཅད་ཅིང་། །
en: “To subjugate the horde of Māra

source: སངས་རྒྱས་བསྟན་པ་འདི་ནི་ཤིན་ཏུ་གཟུང་། །
en: And to uphold this Dharma of the Buddha,

source: བཅོམ་ལྡན་ཕུང་པོ་མ་མཆིས་དམ་ཆོས་མཛོད། །
en: Blessed One, this is the time to explain to embodied beings

source: ལུས་ཅན་རྣམས་ལ་བཤད་པའི་དུས་འདི་ལགས། །
en: The noble Dharma treasury in which the aggregates are absent.

source: སྐྱེས་བུ་ཁྱུ་མཆོག་མཁྱེན་པ་མཐའ་ཡས་པས། །
en: “The knowledge of the leader of beings is endless.

source: བཅོམ་ལྡན་དེ་ལ་བདག་གི་བློ་མི་ཆུད། །
en: Blessed One, I cannot fathom it.

source: བདེ་གཤེགས་མཁྱེན་པ་ཤེས་པས་མི་དཔོགས་པས། །
en: Since my understanding cannot grasp the knowledge of the Sugata,

source: མཁས་པ་ཡངས་པ་བདག་ནི་ཞུ་བར་འཚལ། །
en: I make this request to the vastly learned one:

source: ཇི་ལྟར་བཅོམ་ལྡན་འདས་ཀྱི་མཁྱེན་འཇུག་དང་། །
en: “How does one access the knowledge of the Blessed One,

source: ཇི་ལྟར་ཡུན་རིང་ནས་ནི་བསླབས་པ་དང་། །
en: And for how long does one train,

source: ཆོས་ཀྱི་དབང་ཕྱུག་རྒྱལ་པོ་རབ་བསླབས་པ། །
en: And what is the training of Dharmeśvara­rāja?

source: འདྲེན་པ་རྣམས་ཀྱི་སྤྱོད་ཡུལ་བཤད་དུ་གསོལ། །
en: Please explain the sphere of activity of the guides.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: After Dhāraṇīśvara­rāja had praised the Blessed One with these verses, he added,

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པའི་ཡུལ་ནི་བསམ་གྱིས་མི་ཁྱབ།
en: “Blessed One, the domain of the Tathāgata is inconceivable.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ནི་ཚད་མ་མཆིས་ཏེ།
en: The sphere of conduct of bodhisattvas is beyond measure.

source: བཅོམ་ལྡན་འདས་བདག་གིས་དེ་བཞིན་གཤེགས་པ་ནི་ཡོངས་སུ་མི་སྐྱོ་བར་ཆོས་སྟོན་པ་ལགས་པར་རིག་ཅིང་། དེ་བཞིན་གཤེགས་པ་ནི་སེམས་ཅན་ཐམས་ཅད་མི་གཏོང་བའི་ཐུགས་རྗེ་ཆེན་པོ་ལ་གནས་པར་མཐོང་ནས་
en: I understand that the Tathāgata teaches the Dharma untiringly, and I see that he abides in great compassion, which does not leave any sentient being behind.

source: དོན་འདི་ཞུ་བར་འཚལ་ལོ། །
en: So I ask you this:

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྒྱན་དག་ནི་གང་ལགས།
en: Blessed One, what are the bodhisattva ornaments?

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྒྱན་གང་དག་གིས་བརྒྱན་ན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་མཛེས་པ་ལགས།
en: Blessed One, by what ornaments are the bodhisattvas adorned so they become beautiful while performing bodhisattva conduct?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་ཐོབ་ནས་གཏི་མུག་གི་མུན་པ་དང་བྲལ་ཞིང་ཐེ་ཚོམ་མ་མཆིས་པ་དང་། ཆོས་ཀྱི་སྒོ་ཆེན་པོ་ཤིན་ཏུ་ཡོངས་སུ་སྦྱངས་པ་རྣམས་ལགས།
en: “How, Blessed One, do bodhisattvas, who have attained the inconceivable splendor of the Dharma, become free from the darkness of ignorance and doubt, and how do they become fully trained in the great gateway of Dharma?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་མི་གཏོང་བའི་སྙིང་རྗེ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་ལ་གནས་པ་མཆོག་དང་ལྡན་ཞིང་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་བར་གནས་པ་རྣམས་ལགས།
en: How, Blessed One, do bodhisattvas who never abandon any being become endowed with the supreme foundation of great compassion, which never abandons any being?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དག་བྱང་ཆུབ་སེམས་དཔའི་ལས་ཡང་དག་པ་ལ་ཞུགས་པ་དང་། ལེགས་པར་བགྱིད་པའི་ལས་བགྱིད་པ་དང་། ལས་ཀྱི་མཐའ་གདུང་བ་མ་མཆིས་པ་རྣམས་ལགས།
en: “How, Blessed One, do bodhisattvas engage in bodhisattva actions, carrying them out well without longing for their conclusion?

source: བཅོམ་ལྡན་འདས་ཅི་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་བདུད་དང་ཕྱིར་རྒོལ་བ་བཅོམ་ཞིང་ཐེ་ཚོམ་དང་བྲལ་ནས་དེ་བཞིན་གཤེགས་པའི་ཡུལ་ལ་འཇུག་པར་འགྱུར་བ་དང་།
en: Bodhisattvas will by any means conquer evil and opponents, leave behind all doubt, and enter the Tathāgata domain.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡུལ་ལ་མངོན་དུ་འཕགས་པར་འགྱུར་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ལ་འཇུག་པར་འགྱུར་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་དག་ཡོངས་སུ་འཚལ་བར་འགྱུར་བ་དང་།
en: They will come to prominence within the bodhisattva domain, engage with the thinking of all sentient beings, and understand the mental conduct of all sentient beings.

source: སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་རྣམ་པར་སྦྱོང་བར་འགྱུར་བ་དང་། བདུད་ཀྱི་དཀྱིལ་འཁོར་ཚར་གཅོད་པར་འགྱུར་བ་དང་། དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ཡང་དག་པར་འཛིན་པར་འགྱུར་བ་དང་། མྱུར་དུ་ཆོས་ཐམས་ཅད་ལ་དབང་སྒྱུར་བ་འཐོབ་པར་འགྱུར་བར་
en: They will purify buddhafields, subjugate the hordes of Māra, fully grasp the Dharma of the Tathāgata, and swiftly attain mastery of all teachings.”

source: དེ་བཞིན་གཤེགས་པས་བློ་ཤིན་ཏུ་རྣམ་པར་ངེས་པས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པས་མངོན་པར་འཕགས་པའི་ཆོས་ཀྱི་སྒོ་དེ་ལེགས་པར་བཤད་དུ་གསོལ།
en: Blessed One, I request that the Tathāgata explain The Gateway to Unobstructed Deliverance through the Bodhisattva Way of Life with firm determination so that the following may transpire:

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One responded,

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་ལེགས་སོ། །ལེགས་སོ། །
en: “Excellent, noble being, very good!

source: ཁྱོད་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ཡུལ་ཚད་མེད་པ་ལ་རྣམ་པར་ངེས་པ་ཐོབ་ནས། ཁྱོད་བློ་རྣམ་པར་ངེས་པ་འདི་ལྟ་བུས་དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་འདྲི་བར་སེམས་པ་ནི་སྐྱེས་བུ་དམ་པ་ཁྱོད་ལེགས་སོ། །
en: It is really excellent that you decided to ask the Tathāgata with such determination, after you had attained certainty about the immeasurable conduct of the Tathāgata.

source: དེའི་ཕྱིར་རིགས་ཀྱི་བུ་ཁྱོད་ཤིན་ཏུ་ལེགས་པར་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཇི་ལྟར་ཡོན་ཏན་འདི་དག་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་ཚད་མེད་པ་གཞན་དག་ཀྱང་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་དང་། མྱུར་དུ་ཆོས་ཐམས་ཅད་ལ་དབང་སྒྱུར་བ་འཐོབ་པར་འགྱུར་བ་ངས་ཁྱོད་ལ་བཤད་དོ། །
en: Because of that, son of noble family, I shall explain to you how bodhisattva mahāsattvas perfect these qualities, as well as the other immeasurable bodhisattva qualities, and how they achieve mastery over all teachings. So, listen carefully and keep this in mind.”

source: བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོས་བཅོམ་ལྡན་འདས་ལེགས་སོ་ཞེས་གསོལ་ཏེ།
en: “Very good, Blessed One,” replied Dhāraṇīśvara­rāja.

source: བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: He then listened with full attention as the Blessed One started to teach.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྒྱན་ནི་བཞི་པོ་འདི་དག་སྟེ།
en: “Son of noble family, there are four types of bodhisattva ornaments:

source: ཚུལ་ཁྲིམས་ཀྱི་རྒྱན་དང་། ཏིང་ངེ་འཛིན་གྱི་རྒྱན་དང་། ཤེས་རབ་ཀྱི་རྒྱན་དང་། གཟུངས་ཀྱི་རྒྱན་ཏེ།
en: (1) the ornaments of morality, (2) the ornaments of absorption, (3) the ornaments of insight, and (4) the ornaments of retention.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྒྱན་ནི་བཞི་པོ་འདི་དག་གོ། །
en: Son of noble family, those are the four bodhisattva ornaments.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་རྒྱན་གང་ཞེ་ན།
en: (1) “Son of noble family, you may ask, ‘What are the bodhisattva ornaments of morality?’

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་རྒྱན་ནི་གཅིག་སྟེ།
en: Son of noble family, there is a single bodhisattva ornament of morality:

source: སེམས་ཅན་ཐམས་ཅད་ལ་གནོད་པ་མི་བྱེད་པ་སྟེ།
en: not harming any sentient being.

source: བྱང་ཆུབ་སེམས་དཔའ་ཞེ་སྡང་བའི་སེམས་མེད་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡིད་དུ་འོང་ཞིང་དགའ་བ་སྟེ། རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་རྒྱན་གཅིག་གོ། །
en: A bodhisattva without a hateful disposition, who is pleasant and delightful toward all sentient beings, is endowed with the single bodhisattva ornament of morality.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་རྒྱན་ནི་གཉིས་པོ་འདི་དག་སྟེ།
en: “Son of noble family, there are two types of bodhisattva ornaments of morality:

source: ངན་འགྲོའི་སྒོ་གཅོད་པ་དང་། བདེ་འགྲོའི་སྒོ་འབྱེད་པ་སྟེ། གཉིས་པོ་འདི་དག་གོ། །
en: closing the gateway to the evil destinies and opening the gateway to the blissful destinies.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་རྒྱན་ནི་གསུམ་པོ་འདི་དག་སྟེ།
en: “Son of noble family, there are three types of bodhisattva ornaments of morality:

source: ལུས་རྣམ་པར་དག་པ་དང་། ངག་རྣམ་པར་དག་པ་དང་། ཡིད་རྣམ་པར་དག་པ་སྟེ། གསུམ་པོ་འདི་དག་གོ། །
en: purity in body, purity in speech, and purity in mind.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་རྒྱན་ནི་བཞི་པོ་འདི་དག་སྟེ།
en: “Son of noble family, there are four types of bodhisattva ornaments of morality:

source: གང་འདོད་པ་དེ་འབྱོར་པ་དང་། གང་སྨོན་པ་དེ་ཡང་དག་པར་འགྲུབ་པ་དང་། གང་འདོད་པ་དེ་འཐོབ་པ་དང་། གང་རྩོམ་པ་དེ་ཉམས་འོག་ཏུ་ཆུད་པར་བྱེད་པ་སྟེ། བཞི་པོ་འདི་དག་གོ། །
en: achieving what one desires, accomplishing what one wishes for, attaining what one longs for, and finishing what one begins.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་རྒྱན་ནི་ལྔ་པོ་འདི་དག་སྟེ།
en: “Son of noble family, there are five types of bodhisattva ornaments of morality:

source: ཚུལ་ཁྲིམས་དང་ལྡན་པའི་ཏིང་ངེ་འཛིན་སྒྱུ་མེད་པ་ཡིན། ཤེས་རབ་སྒྱུ་མེད་པ་ཡིན། རྣམ་པར་གྲོལ་བ་སྒྱུ་མེད་པ་ཡིན། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་སྒྱུ་མེད་པ་ཡིན། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་བླ་ན་མེད་པ་སྒྱུ་མེད་པ་ཡིན་ཏེ་ལྔ་པོ་འདི་དག་གོ། །
en: nondeceptive absorption, nondeceptive insight, nondeceptive liberation, nondeceptive vision of liberating wisdom, and unsurpassed mahāparinirvāṇa—all endowed with morality.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་རྒྱན་ནི་དྲུག་པོ་འདི་དག་སྟེ།
en: “Son of noble family, there are six types of bodhisattva ornaments of morality:

source: ཡིད་ལ་ཆགས་པ་མེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕྱིར་སྐྱོན་མེད་པའི་ཚུལ་ཁྲིམས་དང་། ཁ་ན་མ་ཐོ་བ་མེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕྱིར་ཉམས་པ་མེད་པའི་ཚུལ་ཁྲིམས་དང་། འདྲེན་མ་མ་ཡིན་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕྱིར་འདྲེས་པ་མ་ཡིན་པའི་ཚུལ་ཁྲིམས་དང་། དགེ་བའི་ཆོས་ཤིན་ཏུ་རྣམ་པར་འཕེལ་བའི་ཕྱིར་སྲ་སྲེ་མ་ཡིན་པའི་ཚུལ་ཁྲིམས་དང་། གང་གིས་འདོད་པར་འགྲོ་བའི་ཚུལ་ཁྲིམས་ཀྱི་ཕྱིར་རང་དགའི་ཚུལ་ཁྲིམས་དང་། གཞན་ལ་རག་མ་ལུས་པའི་ཤེས་པས་རང་གི་དབང་སྒྱུར་བའི་ཚུལ་ཁྲིམས་ཏེ་དྲུག་པོ་འདི་དག་གོ། །
en: morality that is flawless on account of being without mental attachment, not degenerate on account of being without reproach, not corrupt on account of not being adulterated, free of sin on account of increasing virtuous qualities, unfettered on account of being voluntary, and autonomous on account of being an understanding that does not depend on others.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་རྒྱན་ནི་བདུན་པོ་འདི་དག་སྟེ།
en: “Son of noble family, there are seven types of bodhisattva ornaments of morality:

source: ཚུལ་ཁྲིམས་དང་ལྡན་པའི་སྦྱིན་པ་རྣམ་པར་དག་པ་དང་། བཟོད་པ་རྣམ་པར་དག་པ་དང་། བརྩོན་འགྲུས་རྣམ་པར་དག་པ་དང་། བསམ་གཏན་རྣམ་པར་དག་པ་དང་། ཤེས་རབ་རྣམ་པར་དག་པ་དང་། ཐབས་རྣམ་པར་དག་པ་དང་། བག་ཡོད་པ་རྣམ་པར་དག་པ་སྟེ། བདུན་པོ་འདི་དག་གོ། །
en: pure generosity, pure patience, pure vigor, pure concentration, pure insight, pure method, and pure conscientiousness—all endowed with morality.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་རྒྱན་ནི་བརྒྱད་པོ་འདི་དག་སྟེ།
en: “Son of noble family, there are eight types of bodhisattva ornaments of morality:

source: སྤོབས་པ་ཕུན་སུམ་ཚོགས་པ་དང་། ས་ཕུན་སུམ་ཚོགས་པ་དང་། རྣམ་པར་འཕྲོ་བ་མེད་པ་ཕུན་སུམ་ཚོགས་པ་དང་། ལྷོད་པ་མེད་པ་ཕུན་སུམ་ཚོགས་པ་དང་། འཁོན་དུ་འཛིན་པ་མེད་པ་ཕུན་སུམ་ཚོགས་པ་དང་། སངས་རྒྱས་འབྱུང་བ་མཉེས་པར་བྱེད་པ་ཕུན་སུམ་ཚོགས་པ་དང་། དལ་བ་ཕུན་སུམ་ཚོགས་པ་དང་། དགེ་བའི་བཤེས་གཉེན་མགུ་བར་བྱེད་པ་ཕུན་སུམ་ཚོགས་པ་སྟེ་བརྒྱད་པོ་འདི་དག་གོ། །
en: excellence in eloquence, excellence in the spiritual levels, excellence in lack of distractedness, excellence in lack of idleness, excellence in lack of vindictiveness, excellence in appreciating the appearance of a buddha, excellence in ease, and excellence in venerating one’s spiritual friends.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་རྒྱན་ནི་དགུ་པོ་འདི་དག་སྟེ།
en: “Son of noble family, there are nine types of bodhisattva ornaments of morality:

source: འཇིགས་པ་མེད་པ་ཡིན། སྐྲག་པ་མེད་པ་ཡིན། བསམ་པ་ངེས་པ་ཡིན། ཉེ་བར་ཞི་བ་ཡིན། བསིལ་བ་ཡིན། བཅིངས་པ་ལྷོད་པ་ཡིན། སེམས་ལས་སུ་རུང་བ་ཡིན། སེམས་ཅང་ཤེས་པ་ཡིན། དུལ་བའི་ས་རྗེས་སུ་འཐོབ་པ་ཡིན་ཏེ། དགུ་པོ་འདི་དག་གོ། །
en: being fearless, being without anxiety, being determined, being tranquil, being cool, being released from bondage, being flexible, being well bred, and being accomplished in the stage of being restrained.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་རྒྱན་ནི་བཅུ་པོ་འདི་དག་སྟེ།
en: “Son of noble family, there are ten types of bodhisattva ornaments of morality:

source: མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཡོངས་སུ་རྫོགས་པའི་ཕྱིར་ལུས་ཀྱི་རྒྱན་དང་། ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་བྱེད་པའི་ཕྱིར་ངག་གི་རྒྱན་དང་། ཉོན་མོངས་པ་མེད་པའི་ཕྱིར་སེམས་ཀྱི་རྒྱན་དང་། སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པའི་ཕྱིར་ཞིང་གི་རྒྱན་དང་། བསམ་པ་ཡོངས་སུ་སྤྱོད་པའི་ཕྱིར་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་རྒྱན་དང་། སྡིག་པ་ཐམས་ཅད་མི་བྱེད་པའི་ཕྱིར་སྐྱེ་བའི་རྒྱན་དང་། དེ་བཞིན་གཤེགས་པའི་སྤྱོད་པ་ལ་རྗེས་སུ་སློབ་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་རྒྱན་དང་། ང་རྒྱལ་མེད་པའི་ཕྱིར་ཤེས་པའི་རྒྱན་དང་། དགེ་བའི་རྩ་བ་ཡོངས་སུ་བསྔོ་བའི་ཕྱིར་བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་རྒྱན་དང་། ཚུལ་ཁྲིམས་ཀྱི་རྩ་བ་ལ་གནས་པ་མི་འདོར་བའི་ཕྱིར་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་རྒྱན་ཏེ།
en: the ornaments of body, since bodhisattvas accomplish the auspicious thirty-two major marks and eighty minor signs; speech, since they act on their word; mind, since they lack afflictive emotions; buddhafields, since they accomplish their aspirations; maturing sentient beings, since the bodhisattva intention is pure; birth, since they do not commit any sinful deeds; bodhisattva conduct, since they emulate the tathāgata conduct; understanding, since they lack pride; the seat of awakening, since they dedicate their roots of virtue; and the ornaments of the strengths, the fearlessnesses, and unique buddha qualities, since they do not discard their grounding in the root of moral conduct.

source: རིགས་ཀྱི་བུ་བཅུ་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་རྒྱན་ནོ། །
en: Son of noble family, these are the ten types of bodhisattva ornaments of morality.
